restaurant/ssl/Catalogs/Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Услуги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

restaurant/ssl/InformationRegisters/ЦеныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныУслуг</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

restaurant/ssl/Catalogs/Услуги/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Цена = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите цену";
		Сообщение.Поле = "Цена";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	ТекДата = НачалоДня(ТекущаяДата());          
	
	НаборЗаписей = РегистрыСведений.ЦеныУслуг.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекДата);  
	НаборЗаписей.Отбор.Ресторан.Установить(Объект.Ресторан.Ссылка);
  	НаборЗаписей.Отбор.Услуга.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	
	ЕстьИзменения = Ложь;
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекДата;    
		Запись.Ресторан = Объект.Ресторан.Ссылка;
		Запись.Услуга = ТекущийОбъект.Ссылка;
		Запись.Цена = Цена;  
		
		ЕстьИзменения = Истина;
	Иначе
		Запись = НаборЗаписей.Получить(0);
		Если Запись.Цена <> Цена Тогда
			ЕстьИзменения = Истина;
			Запись.Цена = Цена;
		КонецЕсли;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныУслугСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныУслуг.СрезПоследних(, Услуга = &Услуга) КАК ЦеныУслугСрезПоследних";
	
	Запрос.УстановитьПараметр("Услуга", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Цена = Выборка.Цена;
	КонецЕсли;
КонецПроцедуры
